#!/bin/sh

test -n "`pidof vpn`" && killall vpn

if [ -f "/etc/storage/post_wan_script.sh" ] ; then
boot="/etc/storage/post_wan_script.sh"

if [ -z "`cat $boot | grep -o '\-k'`" ] ; then
cat <<'EOF10'>> "$boot"
sleep 20 && /usr/bin/vpn.sh &
:<<'________'
VPN异地组网配置区
#以下改IP参数，虚似IP最后一位也要对应改，和-d要一起改
#如改本地192.168.30.1,-d 就改30 -o改10.26.0.30
#远端改(另一个路由)-i 192.168.30.0/24,10.26.0.30
-k abc   #串码 所有组网相同
#-s        #服务器地址
-d 20     #路由的名字，不能和组网同名 如：-d  1 2 3
-i 192.168.10.0/24,10.26.0.10   # 对端路由IP,对端路由的虚拟IP 例如:-i 192.168.1.0/24,10.26.0.11
#-i 192.168.1.0/24,10.26.0.11  #多个组网可多个-i就是远端有内个就几个-i前面#列示不用
-o 192.168.20.0/24 #   本路由IP 如：-o 192.168.1.0/24
--ip 10.26.0.20 #   本路由的虚拟IP 如：--ip 10.26.0.11

________
EOF10

fi
